content/presentaciones/Discretas7026/laboratorio.org
* Instalación

  =ghc cabal-install=

  Para este curso necesitaremos un compilador de /Haskell/, y un
  administrador de bibliotecas del lenguaje como /Cabal/.

  La instalación puede variar según su sistema operativo, y es común
  que entre administradores de paquetes de distintas distribuciones de
  linux instalen versiones distintas de los programas necesarios.

  Afortunadamente existe una herramienta que puede unificar el proceso
  de instalación para todos los sistemas operativos.

  [[https://www.haskell.org/ghcup/install/]]

  /GHCup/ nos permite administrar versiones de los programas
  relacionados con el lenguaje de programación haskell.

* Tutorial

  #+begin_src haskell
-- Clase de haskell:

x :: Int
x = 10

i :: Integer
i = 367239123678216478367612471623782638716238762187361872361873628173687216387216387216387216387216216387
  
y :: Float
y =  10.64

z :: Double
z = 10.64

c :: Char
c = 'a'

s :: String
s = "Hola"

var :: Int
var = 5

var2 :: Int
var2 = 6

tupla1 :: (Int, String)
tupla1 = (10, "Cadena")

tupla2 :: (Int, Char, Float, Double, String)
tupla2 = (1, 'a', 0.5, 0.10, "Adios")

f :: Double -> Double
f x = x ^ 2

a :: Double
a = f 128371893129.0
  #+end_src

  El anterior es el archivo que hicimos el viernest 16 de Agosto.

  Guárdenlo en un archivo con extensión =.hs=, por ejemplo =tutorial.hs=.

  Recuerden que para cargar el archivo en el intérprete es con el
  comando:

  #+begin_src bash
$ ghci tutorial.hs
  #+end_src

  Desde luego, estando en el directorio en donde se encuentra el
  archivo =tutorial.hs=.

  ésto les abrirá el intérprete tomando como contexto el archivo que
  crearon.

* Glosario de comandos en ghci

  - =:l= para cargar un archivo desde el intérprete. (Estando en el
    directorio donde se encuentra el archivo.)

    #+begin_src haskell
ghci> :l tutorial.hs
[1 of 2] Compiling Main             ( tutorial.hs, interpreted )
Ok, one module loaded.
ghci> :l tutorial.hs
    #+end_src

  - =:r= para recargar un achivo que ya fue cargado en =ghci=
    anteriormente.

    #+begin_src haskell
ghci> :r
[1 of 2] Compiling Main             ( tutorial.hs, interpreted ) [Source file changed]
Ok, one module loaded.
ghci> 
    #+end_src

  - Dentro del intérprete pueden utilizar las funciones o variables
    creadas:

    #+begin_src haskell
ghci> f 5
25.0
ghci> a
1.6479342945523397e22  
    #+end_src
  
* Tipos de dato algebraicos y coincidencia de patrones

  En matemáticas discretas podemos introducir definiciones de
  conjuntos como estructuras recursivas dando los casos de definición
  y un axioma de clausura, indicando que ninguna otra cosa forma parte
  de lo definido.

  Los tipos de dato algebraicos han sido adoptados por distintos
  lenguajes de programación, particularmente los funcionales, en donde
  /Haskell/ no es la excepción.

  Nosotros podemos crear tipos de dato a partir de definir quienes van
  a ser elementos de ese tipo (ese conjunto).

  Por ejemplo, tomemos en cuenta una definición simple de los colores
  que componen el esquema de colores /RGB/.

  El conjunto de colores /RGB/ se construye con las siguientes reglas:

  1. El Rojo es un color /RGB/.
  2. El Verde es un color /RGB/.
  3. El Azul es un color /RGB/.
  4. Sólo los elementos generados por 1, 2 y 3 son colores /RGB/.


  En Haskell podemos dar estas mismas definiciones, con la palabra
  reservada =data=.

  #+begin_src haskell
data RGB = Rojo
         | Verde
         | Azul
  #+end_src

  En donde =RGB= corresponde al nombre que queremos que tenga nuestro
  tipo de dato, este nombre *siempre debe iniciar con mayúscula*.

  Despúes del === siguen las reglas que componen a ese tipo de dato,
  separando cada una de ellas por un =|=.

  Y cada regla comienza con el nombre de lo que se conoce como el
  *constructor*, en este caso los constructores son =Rojo=, =Verde=,
  =Azul=. Los constructores también pueden llevar cualquier nombre
  siempre y cuando *comiencen con mayúscula*.

  Con esto definido ya podemos considerar el tipo de dato =RGB= para
  utilizarlo en variables o funciones.

  #+begin_src haskell
azul :: RGB
azul = Azul

verde :: RGB
verde = Rojo
  #+end_src

