presentaciones/Discretas7026/laboratorio.html

<div id="outline-container-org24ee46d" class="outline-2">
<h2 id="org24ee46d">Instalación</h2>
<div class="outline-text-2" id="text-org24ee46d">
<p>
<code>ghc cabal-install</code>
</p>

<p>
Para este curso necesitaremos un compilador de <i>Haskell</i>, y un
administrador de bibliotecas del lenguaje como <i>Cabal</i>.
</p>

<p>
La instalación puede variar según su sistema operativo, y es común
que entre administradores de paquetes de distintas distribuciones de
linux instalen versiones distintas de los programas necesarios.
</p>

<p>
Afortunadamente existe una herramienta que puede unificar el proceso
de instalación para todos los sistemas operativos.
</p>

<p>
<a href="https://www.haskell.org/ghcup/install/">https://www.haskell.org/ghcup/install/</a>
</p>

<p>
<i>GHCup</i> nos permite administrar versiones de los programas
relacionados con el lenguaje de programación haskell.
</p>
</div>
</div>

<div id="outline-container-orgdcd862e" class="outline-2">
<h2 id="orgdcd862e">Tutorial</h2>
<div class="outline-text-2" id="text-orgdcd862e">
<div class="org-src-container">
<pre class="src src-haskell">-- Clase de haskell:

x :: Int
x = 10

i :: Integer
i = 367239123678216478367612471623782638716238762187361872361873628173687216387216387216387216387216216387

y :: Float
y =  10.64

z :: Double
z = 10.64

c :: Char
c = 'a'

s :: String
s = "Hola"

var :: Int
var = 5

var2 :: Int
var2 = 6

tupla1 :: (Int, String)
tupla1 = (10, "Cadena")

tupla2 :: (Int, Char, Float, Double, String)
tupla2 = (1, 'a', 0.5, 0.10, "Adios")

f :: Double -&gt; Double
f x = x ^ 2

a :: Double
a = f 128371893129.0
</pre>
</div>

<p>
El anterior es el archivo que hicimos el viernest 16 de Agosto.
</p>

<p>
Guárdenlo en un archivo con extensión <code>.hs</code>, por ejemplo <code>tutorial.hs</code>.
</p>

<p>
Recuerden que para cargar el archivo en el intérprete es con el
comando:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ ghci tutorial.hs
</pre>
</div>

<p>
Desde luego, estando en el directorio en donde se encuentra el
archivo <code>tutorial.hs</code>.
</p>

<p>
ésto les abrirá el intérprete tomando como contexto el archivo que
crearon.
</p>
</div>
</div>

<div id="outline-container-org9e63bc5" class="outline-2">
<h2 id="org9e63bc5">Glosario de comandos en ghci</h2>
<div class="outline-text-2" id="text-org9e63bc5">
<ul class="org-ul">
<li><p>
<code>:l</code> para cargar un archivo desde el intérprete. (Estando en el
directorio donde se encuentra el archivo.)
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; :l tutorial.hs
[1 of 2] Compiling Main             ( tutorial.hs, interpreted )
Ok, one module loaded.
ghci&gt; :l tutorial.hs
</pre>
</div></li>

<li><p>
<code>:r</code> para recargar un achivo que ya fue cargado en <code>ghci</code>
anteriormente.
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; :r
[1 of 2] Compiling Main             ( tutorial.hs, interpreted ) [Source file changed]
Ok, one module loaded.
ghci&gt; 
</pre>
</div></li>

<li><p>
Dentro del intérprete pueden utilizar las funciones o variables
creadas:
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; f 5
25.0
ghci&gt; a
1.6479342945523397e22  
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org1cff758" class="outline-2">
<h2 id="org1cff758">Tipos de dato algebraicos y coincidencia de patrones</h2>
<div class="outline-text-2" id="text-org1cff758">
<p>
En matemáticas discretas podemos introducir definiciones de
conjuntos como estructuras recursivas dando los casos de definición
y un axioma de clausura, indicando que ninguna otra cosa forma parte
de lo definido.
</p>

<p>
Los tipos de dato algebraicos han sido adoptados por distintos
lenguajes de programación, particularmente los funcionales, en donde
<i>Haskell</i> no es la excepción.
</p>

<p>
Nosotros podemos crear tipos de dato a partir de definir quienes van
a ser elementos de ese tipo (ese conjunto).
</p>

<p>
Por ejemplo, tomemos en cuenta una definición simple de los colores
que componen el esquema de colores <i>RGB</i>.
</p>

<p>
El conjunto de colores <i>RGB</i> se construye con las siguientes reglas:
</p>

<ol class="org-ol">
<li>El Rojo es un color <i>RGB</i>.</li>
<li>El Verde es un color <i>RGB</i>.</li>
<li>El Azul es un color <i>RGB</i>.</li>
<li>Sólo los elementos generados por 1, 2 y 3 son colores <i>RGB</i>.</li>
</ol>


<p>
En Haskell podemos dar estas mismas definiciones, con la palabra
reservada <code>data</code>.
</p>

<div class="org-src-container">
<pre class="src src-haskell">data RGB = Rojo
         | Verde
         | Azul
</pre>
</div>

<p>
En donde <code>RGB</code> corresponde al nombre que queremos que tenga nuestro
tipo de dato, este nombre <b>siempre debe iniciar con mayúscula</b>.
</p>

<p>
Despúes del <code>=</code> siguen las reglas que componen a ese tipo de dato,
separando cada una de ellas por un <code>|</code>.
</p>

<p>
Y cada regla comienza con el nombre de lo que se conoce como el
<b>constructor</b>, en este caso los constructores son <code>Rojo</code>, <code>Verde</code>,
<code>Azul</code>. Los constructores también pueden llevar cualquier nombre
siempre y cuando <b>comiencen con mayúscula</b>.
</p>

<p>
Con esto definido ya podemos considerar el tipo de dato <code>RGB</code> para
utilizarlo en variables o funciones.
</p>

<div class="org-src-container">
<pre class="src src-haskell">azul :: RGB
azul = Azul

verde :: RGB
verde = Rojo
</pre>
</div>
</div>
