content/presentaciones/Discretas7026/laboratorio.org
** Coincidencia de patrones

   Y bueno, ¿cómo realizamos operaciones con éste tipo de dato que
   acabamos de crear?

   =Haskell= tiene una característica que permite descomponer la forma
   que tiene una expresión y ver con qué caso le corresponde.

   Supongamos que queremos hacer una función que nos regrese en una
   cadena de texto cuál es el color que está recibiendo.

   #+begin_src haskell
color :: RGB -> String
color x = case x of
            Rojo -> "El color es rojo"
            Verde -> "El color es verde"
            Azul -> "El color es azul"
   #+end_src

   Una forma de hacerlo es con la expresión =case ... of=. En donde lo
   que sigue después del =case= es la expresión que queremos
   analizar. En este caso, por la firma que tiene la función, sabemos
   que =x= es del tipo =RGB= y que =x= sólo tiene tres formas de
   construirse: =Rojo=, =Verde= y =Azul=.

   Con esta coincidencia de patrones =haskell= revisará con qué
   expresión que pusieron después del =of= coincide primero la expresión
   =x= (es decir, revisará en el orden que hayan puesto los casos, en
   este ejemplo, primero revisará si =x= es =Rojo=, después =Verde= y al
   final =Azul=).

   #+begin_src haskell
ghci> color Azul
"El color es azul"
   #+end_src

   Siempre va a ser una buena práctica colocar todas las formas
   posibles que podría tener =x=, pues =haskell= compilará aún si no
   abarcaron todos los casos posibles, por ejemplo:

   #+begin_src haskell
color' :: RGB -> String
color' x = case x of
             Rojo -> "El color es rojo"
             Verde -> "El color es verde"
   #+end_src

   Pero en este caso =haskell= nos lanzará un error cuando intentemos
   evaluar la función con el valor =Azul=.

   #+begin_src haskell
ghci> color' Azul
"*** Exception: ej.hs:(6,12)-(8,41): Non-exhaustive patterns in case
   #+end_src
   
   Precisamente nos dice que no fuimos exhaustivos en nuestra
   coincidencia de patrones.

   No es la única forma en la que podemos hacer coincidencia de
   patrones, en este caso como sólo nos importa qué forma tiene el
   mismo parámetro de la función, entonces podríamos reducir la
   función anterior como sigue:

   #+begin_src haskell
color1 :: RGB -> String
color1 Rojo = "El color es rojo"
color1 Verde = "El color es verde"
color1 Azul = "El color es azul"
   #+end_src

   Poniendo definiciones distintas para cada caso de =x=.

   También podemos dar definiciones incompletas y también nos
   devolverá un error:

   #+begin_src haskell
color1' :: RGB -> String
color1' Rojo = "El color es rojo"
color1' Verde = "El color es verde"
   #+end_src

   #+begin_src haskell
ghci> color1' Azul
"*** Exception: ej.hs:(11,1)-(12,35): Non-exhaustive patterns in function color1'
   #+end_src

   ¿Cuándo queremos utilizar la función =case ... of= en lugar de
   utilizar coincidencia de patrones directamente en el parámetro?

   Imaginemos que tenemos la función que nos da el color que sigue al
   que recibió como parámetro.

   #+begin_src haskell
siguiente :: RGB -> RGB
siguiente Rojo = Verde
siguiente Verde = Azul
siguiente Azul = Rojo
   #+end_src

   Este orden es arbitrario, pero con esta expresión intento decir que
   el color que le sigue al rojo es el verde, y al que le sigue al
   verde es el azul.

   Si quisiéramos hacer una función que nos diga en una cadena de
   texto cuál es el color que le sigue a otro, una forma de hacerlo
   podría ser recordando ese orden y hacer la función de esa forma.

   #+begin_src haskell
siguienteColor :: RGB -> String
siguienteColor Rojo = "El color que sigue es el verde"
...
   #+end_src

   Sin embargo, esto no es una buena práctica ya que nosotros de una u
   otra forma estamos imitando la funcionalidad de =siguiente= que
   habíamos definido con anterioridad, y los programadores siempre
   tenemos que evitar de reinventar la rueda a toda costa.

   Bueno, pues gracias a =case ... of= podemos capturar los resultados
   que nos puede regresar la función =siguiente=.

   #+begin_src haskell
siguienteColor :: RGB -> String
siguienteColor x = case siguiente x of
                     Rojo -> "El color que sigue es el rojo"
                     Verde -> "El color que sigue es el verde"
                     Azul -> "El color que sigue es el azul"
   #+end_src

   Entonces una forma de hacer coincidencia de patrones no desprecia a
   la otra, utilicen las dos como mejor les convenga.

** Constructores con parámetros

   Nuestros constructores en las definiciones de tipo de dato pueden
   tener parámetros.

   Supongamos que queremos un tipo de dato que nos diga una
   combinación de dos colores.

   #+begin_src haskell
data Combinacion = Comb RGB RGB
   #+end_src

   En este caso =Comb= es un constructor que tiene dos parámetros, y en
   estos sólamente indicamos el tipo que queremos que tengan esos
   parámetros.
   
   ¿Y cómo manejamos éste tipo de dato?

   Supongamos que queremos una función que nos diga el primer color
   que conforma la combinación:

   #+begin_src haskell
primero :: Combinacion -> RGB
primero c = ...
   #+end_src

   Bueno, el primer parámetro es una Combinacion, entonces podemos
   descomponer el parámetro =c= usando coincidencia de patrones, y en
   este caso como recibe parámetros es necesario descomponerlo entre
   paréntesis.

   #+begin_src haskell
primero :: Combinacion -> RGB
primero (Comb ...) = ...  
   #+end_src

   ¿Pero qué es lo que sigue? Bueno, sabemos que ambos parámetros son
   de tipo =RGB=, entonces también los podríamos descomponer.

   #+begin_src haskell
primero :: Combinacion -> RGB
primero (Comb Rojo Rojo) = Rojo
primero (Comb Rojo Verde) = Rojo
primero (Comb Rojo Azul) = Rojo
...
   #+end_src

   Pero, ¿es necesario revisar absolutamente todas las posibilidades
   de esas dos entradas cuando únicamente sólo nos interesa el primer
   color? No, y por eso también podemos reemplazar esos dos parámetros
   con variables.

   #+begin_src haskell
primero :: Combinacion -> RGB
primero (Comb primerColor segundoColor) = primerColor
   #+end_src

   Usando variables estamos indicándole a =Haskell= que cualquier caso
   (en este caso del =RGB=) puede ser capturado dentro esas variables.
   
   Supongamos que queremos hacer un tipo de dato para los números
   complejos, es decir que contengan un número para la parte real, y
   otro número real para la parte imaginaria.

   #+begin_src haskell
data Complejo = Comp Double Double
   #+end_src

   =Comp= va a ser el constructor que tiene dos parámetros, en este caso
   decidimos que ambos parámetros que corresponden para la parte real
   y la parte imaginaria (en ese orden) fueran =Double=.

   Y la forma de hacer coincidencia de patrones con éste tipo de dato
   es como sigue:

   #+begin_src haskell
parteReal :: Complejo -> Double
parteReal (Comp r i) = r
   #+end_src

   En donde =r= corresponde al primer =Double= que es el que vamos a
   tratar como la parte real del número e =i= como la que vamos a tratar
   como imaginaria.

   Por eso es que las tuplas se pueden manejar de la siguiente forma en =haskell=

   #+begin_src haskell
sumatupla :: (Int, Int) -> Int
sumatupla (x,y) = x + y
   #+end_src

   Revisa la forma que tiene la tupla y hacemos coincidencia de
   patrones con ella.

