presentaciones/Discretas7026/laboratorio.html

<div id="outline-container-org6375c49" class="outline-3">
<h3 id="org6375c49">Coincidencia de patrones</h3>
<div class="outline-text-3" id="text-org6375c49">
<p>
Y bueno, ¿cómo realizamos operaciones con éste tipo de dato que
acabamos de crear?
</p>

<p>
<code>Haskell</code> tiene una característica que permite descomponer la forma
que tiene una expresión y ver con qué caso le corresponde.
</p>

<p>
Supongamos que queremos hacer una función que nos regrese en una
cadena de texto cuál es el color que está recibiendo.
</p>

<div class="org-src-container">
<pre class="src src-haskell">color :: RGB -&gt; String
color x = case x of
            Rojo -&gt; "El color es rojo"
            Verde -&gt; "El color es verde"
            Azul -&gt; "El color es azul"
</pre>
</div>

<p>
Una forma de hacerlo es con la expresión <code>case ... of</code>. En donde lo
que sigue después del <code>case</code> es la expresión que queremos
analizar. En este caso, por la firma que tiene la función, sabemos
que <code>x</code> es del tipo <code>RGB</code> y que <code>x</code> sólo tiene tres formas de
construirse: <code>Rojo</code>, <code>Verde</code> y <code>Azul</code>.
</p>

<p>
Con esta coincidencia de patrones <code>haskell</code> revisará con qué
expresión que pusieron después del <code>of</code> coincide primero la expresión
<code>x</code> (es decir, revisará en el orden que hayan puesto los casos, en
este ejemplo, primero revisará si <code>x</code> es <code>Rojo</code>, después <code>Verde</code> y al
final <code>Azul</code>).
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; color Azul
"El color es azul"
</pre>
</div>

<p>
Siempre va a ser una buena práctica colocar todas las formas
posibles que podría tener <code>x</code>, pues <code>haskell</code> compilará aún si no
abarcaron todos los casos posibles, por ejemplo:
</p>

<div class="org-src-container">
<pre class="src src-haskell">color' :: RGB -&gt; String
color' x = case x of
             Rojo -&gt; "El color es rojo"
             Verde -&gt; "El color es verde"
</pre>
</div>

<p>
Pero en este caso <code>haskell</code> nos lanzará un error cuando intentemos
evaluar la función con el valor <code>Azul</code>.
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; color' Azul
"*** Exception: ej.hs:(6,12)-(8,41): Non-exhaustive patterns in case
</pre>
</div>

<p>
Precisamente nos dice que no fuimos exhaustivos en nuestra
coincidencia de patrones.
</p>

<p>
No es la única forma en la que podemos hacer coincidencia de
patrones, en este caso como sólo nos importa qué forma tiene el
mismo parámetro de la función, entonces podríamos reducir la
función anterior como sigue:
</p>

<div class="org-src-container">
<pre class="src src-haskell">color1 :: RGB -&gt; String
color1 Rojo = "El color es rojo"
color1 Verde = "El color es verde"
color1 Azul = "El color es azul"
</pre>
</div>

<p>
Poniendo definiciones distintas para cada caso de <code>x</code>.
</p>

<p>
También podemos dar definiciones incompletas y también nos
devolverá un error:
</p>

<div class="org-src-container">
<pre class="src src-haskell">color1' :: RGB -&gt; String
color1' Rojo = "El color es rojo"
color1' Verde = "El color es verde"
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; color1' Azul
"*** Exception: ej.hs:(11,1)-(12,35): Non-exhaustive patterns in function color1'
</pre>
</div>

<p>
¿Cuándo queremos utilizar la función <code>case ... of</code> en lugar de
utilizar coincidencia de patrones directamente en el parámetro?
</p>

<p>
Imaginemos que tenemos la función que nos da el color que sigue al
que recibió como parámetro.
</p>

<div class="org-src-container">
<pre class="src src-haskell">siguiente :: RGB -&gt; RGB
siguiente Rojo = Verde
siguiente Verde = Azul
siguiente Azul = Rojo
</pre>
</div>

<p>
Este orden es arbitrario, pero con esta expresión intento decir que
el color que le sigue al rojo es el verde, y al que le sigue al
verde es el azul.
</p>

<p>
Si quisiéramos hacer una función que nos diga en una cadena de
texto cuál es el color que le sigue a otro, una forma de hacerlo
podría ser recordando ese orden y hacer la función de esa forma.
</p>

<div class="org-src-container">
<pre class="src src-haskell">siguienteColor :: RGB -&gt; String
siguienteColor Rojo = "El color que sigue es el verde"
...
</pre>
</div>

<p>
Sin embargo, esto no es una buena práctica ya que nosotros de una u
otra forma estamos imitando la funcionalidad de <code>siguiente</code> que
habíamos definido con anterioridad, y los programadores siempre
tenemos que evitar de reinventar la rueda a toda costa.
</p>

<p>
Bueno, pues gracias a <code>case ... of</code> podemos capturar los resultados
que nos puede regresar la función <code>siguiente</code>.
</p>

<div class="org-src-container">
<pre class="src src-haskell">siguienteColor :: RGB -&gt; String
siguienteColor x = case siguiente x of
                     Rojo -&gt; "El color que sigue es el rojo"
                     Verde -&gt; "El color que sigue es el verde"
                     Azul -&gt; "El color que sigue es el azul"
</pre>
</div>

<p>
Entonces una forma de hacer coincidencia de patrones no desprecia a
la otra, utilicen las dos como mejor les convenga.
</p>
</div>
</div>

<div id="outline-container-org3b1b409" class="outline-3">
<h3 id="org3b1b409">Constructores con parámetros</h3>
<div class="outline-text-3" id="text-org3b1b409">
<p>
Nuestros constructores en las definiciones de tipo de dato pueden
tener parámetros.
</p>

<p>
Supongamos que queremos un tipo de dato que nos diga una
combinación de dos colores.
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Combinacion = Comb RGB RGB
</pre>
</div>

<p>
En este caso <code>Comb</code> es un constructor que tiene dos parámetros, y en
estos sólamente indicamos el tipo que queremos que tengan esos
parámetros.
</p>

<p>
¿Y cómo manejamos éste tipo de dato?
</p>

<p>
Supongamos que queremos una función que nos diga el primer color
que conforma la combinación:
</p>

<div class="org-src-container">
<pre class="src src-haskell">primero :: Combinacion -&gt; RGB
primero c = ...
</pre>
</div>

<p>
Bueno, el primer parámetro es una Combinacion, entonces podemos
descomponer el parámetro <code>c</code> usando coincidencia de patrones, y en
este caso como recibe parámetros es necesario descomponerlo entre
paréntesis.
</p>

<div class="org-src-container">
<pre class="src src-haskell">primero :: Combinacion -&gt; RGB
primero (Comb ...) = ...  
</pre>
</div>

<p>
¿Pero qué es lo que sigue? Bueno, sabemos que ambos parámetros son
de tipo <code>RGB</code>, entonces también los podríamos descomponer.
</p>

<div class="org-src-container">
<pre class="src src-haskell">primero :: Combinacion -&gt; RGB
primero (Comb Rojo Rojo) = Rojo
primero (Comb Rojo Verde) = Rojo
primero (Comb Rojo Azul) = Rojo
...
</pre>
</div>

<p>
Pero, ¿es necesario revisar absolutamente todas las posibilidades
de esas dos entradas cuando únicamente sólo nos interesa el primer
color? No, y por eso también podemos reemplazar esos dos parámetros
con variables.
</p>

<div class="org-src-container">
<pre class="src src-haskell">primero :: Combinacion -&gt; RGB
primero (Comb primerColor segundoColor) = primerColor
</pre>
</div>

<p>
Usando variables estamos indicándole a <code>Haskell</code> que cualquier caso
(en este caso del <code>RGB</code>) puede ser capturado dentro esas variables.
</p>

<p>
Supongamos que queremos hacer un tipo de dato para los números
complejos, es decir que contengan un número para la parte real, y
otro número real para la parte imaginaria.
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Complejo = Comp Double Double
</pre>
</div>

<p>
<code>Comp</code> va a ser el constructor que tiene dos parámetros, en este caso
decidimos que ambos parámetros que corresponden para la parte real
y la parte imaginaria (en ese orden) fueran <code>Double</code>.
</p>

<p>
Y la forma de hacer coincidencia de patrones con éste tipo de dato
es como sigue:
</p>

<div class="org-src-container">
<pre class="src src-haskell">parteReal :: Complejo -&gt; Double
parteReal (Comp r i) = r
</pre>
</div>

<p>
En donde <code>r</code> corresponde al primer <code>Double</code> que es el que vamos a
tratar como la parte real del número e <code>i</code> como la que vamos a tratar
como imaginaria.
</p>

<p>
Por eso es que las tuplas se pueden manejar de la siguiente forma en <code>haskell</code>
</p>

<div class="org-src-container">
<pre class="src src-haskell">sumatupla :: (Int, Int) -&gt; Int
sumatupla (x,y) = x + y
</pre>
</div>

<p>
Revisa la forma que tiene la tupla y hacemos coincidencia de
patrones con ella.
</p>
</div>
</div>
