content/presentaciones/Discretas7026/laboratorio.org
** Tipos de dato recursivos

   Así mismo como en matemáticas podemos también dar definiciones de
   tipos de dato (de conjuntos) de forma inductiva/recursiva.

   Recordemos las reglas para construir los números naturales:

   1. $0$ es un número natural.
   2. Si $n$ es un número natural, entonces el sucesor de $n$
      ($Suc(n)$) también es un número natural.
   3. Sólo los elementos generados por 1 y 2 son naturales.


   En =Haskell= podemos recrear este tipo de dato bajo esta misma
   semántica combinando constructores sencillos, como constructores
   con parámetros.

   #+begin_src haskell
data Natural = Cero
             | Suc Natural
   #+end_src

   =Cero= sería nuestro caso base, y =Suc= es un constructor que recibe
   otro número natural como parámetro.

   Nótese que en ésta definición estamos utilizando a los mismos
   números naturales para definir a los números naturales.

   Y con esto ya tenemos una definición de los naturales.

   #+begin_src haskell
cero :: Natural
cero = Cero

uno :: Natural
uno = Suc Cero

dos :: Natural
dos = Suc (Suc (Cero))

tres :: Natural
tres = Suc dos
   #+end_src

   Como ejemplo, definamos la suma entre naturales:

   #+begin_src haskell
sumaNat :: Natural -> Natural -> Natural
sumaNat Cero m = m
sumaNat (Suc n) m = sumaNat n (Suc m)
   #+end_src
   
** Tipos de dato con parámetros

   Nuestros tipos de dato también pueden llevar parámetros en su
   definición; recrearemos el tipo de dato =Maybe= de =Haskell=:

   #+begin_src haskell
data Talvez a = Nada
              | Solo a
   #+end_src

   ¿Qué significa ésto?

   =Talvez a= define el nombre del tipo =Talvez= y la =a= es una variable
   que representa un tipo cualquiera que usaremos dentro de la
   definición y la nombraremos como =a=.

   Tiene un constructor básico =Nada=, y un constructor con parámetro
   =Solo= cuyo primer parámetro debe ser algo del tipo =a=.

   Ejemplos de tipos de dato =Talvez=:

   #+begin_src haskell
talvez1 :: Talvez Int
talvez1 = Solo 10

talvez2 :: Talvez Int
talvez2 = Nada

talvez3 :: Talvez String
talvez3 = Solo "Hola"

talvez4 :: Talvez Double
talvez4 = Nada

talvez5 :: Talvez Natural
talvez5 = Solo (Suc Cero)

talvez6 :: Talvez (Talvez Int)
talvez6 = Solo (Solo 1)
   #+end_src

   ¿Qué utilidad tiene este tipo de dato?

   Funciona para devolver errores y capturarlos.

   Consideremos el operador =/=, qué nos devuelve si intentamos dividir
   por cero?

   #+begin_src haskell
ghci> 1 / 0
Infinity
ghci> 0 / 0
NaN
   #+end_src

   En ambos casos nos deuvelve un error que es algo complicado de
   capturar.

   Hagamos una función para realizar la división de manera "segura".

   #+begin_src haskell
safediv :: Double -> Double -> Talvez Double
safediv x y
  | y == 0 = Nada
  | otherwise = Solo (x / y)
   #+end_src

   De esta forma podemos capturar estos errores al momento de realizar
   más operaciones con éstos elementos.

   Supongamos que queremos utilizar esta función y al final al
   resultado añadirle uno si es que no ocurrió un error:

   #+begin_src haskell
divadd1 :: Double -> Double -> Talvez Double
divadd1 x y = case safediv x y of
                Nada -> Nada
                Solo r -> Solo (r + 1)
   #+end_src

   La definición del tipo de dato =Maybe= (que ya viene en /haskell/) es
   como sigue:

   #+begin_src haskell
data Maybe a = Nothing
             | Just a 
   #+end_src
   
   También las definiciones de tipo pueden llevar más de un parámetro
   en su tipo. Definamos nuestra propia tupla

   #+begin_src haskell
data Tupla a b = Tup a b
   #+end_src

   Recibe dos tipos cualesquiera =a= y =b=, y su constructor =Tup= recibe
   esos mismos parámetros respectivamente.

   #+begin_src haskell
intDouble :: Tupla Int Double
intDouble = Tup 5 10.9

stringDouble :: Tupla String Double
stringDouble = Tup "Hola" 10.18
   #+end_src

* Listas

  Las listas de elementos de tipo $A$ se construyen con las siguientes
  reglas:

  1. La lista vacía es una lista de elementos de tipo $A$.

  2. Si $X$ es un elemento de tipo $A$ y $XS$ una lista de elementos
     de tipo $A$, entonces la construcción de $X$ con $XS$ ($X:XS$) es
     otra lista de elementos de tipo $A$.

  3. Sólo los elementos construidos con las reglas 1 y 2 son listas de
     elementos de tipo $A$.


  Entonces podemos describir una lista en /haskell/ de la siguiente
  forma:

  #+begin_src haskell
data Lista a = Nil
             | Cons a (Lista a)
  #+end_src

  #+begin_src haskell
nums :: Lista Int
nums = Cons 1 (Cons 2 (Cons 3 Nil))

strings :: Lista String
strings = Cons "Hola" (Cons "grupo" Nil)

nil :: Lista Double
nil = Nil

unEntero :: Lista Int
unEntero = Cons 1 Nil

listaDeListas :: Lista (Lista Int)
listaDeListas = Cons (Cons 1 (Cons 2 Nil)) (Cons (Cons 3 (Cons 4 Nil)) Nil)
  #+end_src

  /Haskell/ ya tiene su propia definición de listas, y es algo parecido
  a la siguiente:

  #+begin_src haskell
data [] a = []
          | a : ([] a)
  #+end_src

  Aquí ellos utilizan un operador =:= en lugar de un constructor como
  nosotros los hemos visto, y ésto es posible porque Haskell admite
  operadores binarios en lugar de constructores tradicionales siempre
  y cuando éstos comiencen con =:=

  De esta forma /Haskell/ perite la construcción de listas de la
  siguiente manera:

  #+begin_src haskell
nums :: [] Int
nums = 1 : 2 : 3 []

strings :: [] String
strings = "Hola" : "grupo" : []

nil :: [] Double
nil = []

listaDeListas :: [] ([] Int)
listaDeListas = (1 : 2 : []) : (3 : 4 : []) : []
  #+end_src

  Y /haskell/ ofrece una sintaxis aún más sencilla para construir
  estas mismas listas, es la siguiente:

  #+begin_src haskell
nums :: [Int]
nums = [1,2,3]

strings :: [String]
strings = ["Hola","grupo"]

nil :: [Double]
nil = []

listaDeListas :: [[Int]]
listaDeListas = [[1,2],[3,4]]
  #+end_src

