presentaciones/Discretas7026/laboratorio.html

<div id="outline-container-org91b0575" class="outline-3">
<h3 id="org91b0575">Tipos de dato recursivos</h3>
<div class="outline-text-3" id="text-org91b0575">
<p>
Así mismo como en matemáticas podemos también dar definiciones de
tipos de dato (de conjuntos) de forma inductiva/recursiva.
</p>

<p>
Recordemos las reglas para construir los números naturales:
</p>

<ol class="org-ol">
<li>\(0\) es un número natural.</li>
<li>Si \(n\) es un número natural, entonces el sucesor de \(n\)
(\(Suc(n)\)) también es un número natural.</li>
<li>Sólo los elementos generados por 1 y 2 son naturales.</li>
</ol>


<p>
En <code>Haskell</code> podemos recrear este tipo de dato bajo esta misma
semántica combinando constructores sencillos, como constructores
con parámetros.
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Natural = Cero
             | Suc Natural
</pre>
</div>

<p>
<code>Cero</code> sería nuestro caso base, y <code>Suc</code> es un constructor que recibe
otro número natural como parámetro.
</p>

<p>
Nótese que en ésta definición estamos utilizando a los mismos
números naturales para definir a los números naturales.
</p>

<p>
Y con esto ya tenemos una definición de los naturales.
</p>

<div class="org-src-container">
<pre class="src src-haskell">cero :: Natural
cero = Cero

uno :: Natural
uno = Suc Cero

dos :: Natural
dos = Suc (Suc (Cero))

tres :: Natural
tres = Suc dos
</pre>
</div>

<p>
Como ejemplo, definamos la suma entre naturales:
</p>

<div class="org-src-container">
<pre class="src src-haskell">sumaNat :: Natural -&gt; Natural -&gt; Natural
sumaNat Cero m = m
sumaNat (Suc n) m = sumaNat n (Suc m)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfc7e5df" class="outline-3">
<h3 id="orgfc7e5df">Tipos de dato con parámetros</h3>
<div class="outline-text-3" id="text-orgfc7e5df">
<p>
Nuestros tipos de dato también pueden llevar parámetros en su
definición; recrearemos el tipo de dato <code>Maybe</code> de <code>Haskell</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Talvez a = Nada
              | Solo a
</pre>
</div>

<p>
¿Qué significa ésto?
</p>

<p>
<code>Talvez a</code> define el nombre del tipo <code>Talvez</code> y la <code>a</code> es una variable
que representa un tipo cualquiera que usaremos dentro de la
definición y la nombraremos como <code>a</code>.
</p>

<p>
Tiene un constructor básico <code>Nada</code>, y un constructor con parámetro
<code>Solo</code> cuyo primer parámetro debe ser algo del tipo <code>a</code>.
</p>

<p>
Ejemplos de tipos de dato <code>Talvez</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell">talvez1 :: Talvez Int
talvez1 = Solo 10

talvez2 :: Talvez Int
talvez2 = Nada

talvez3 :: Talvez String
talvez3 = Solo "Hola"

talvez4 :: Talvez Double
talvez4 = Nada

talvez5 :: Talvez Natural
talvez5 = Solo (Suc Cero)

talvez6 :: Talvez (Talvez Int)
talvez6 = Solo (Solo 1)
</pre>
</div>

<p>
¿Qué utilidad tiene este tipo de dato?
</p>

<p>
Funciona para devolver errores y capturarlos.
</p>

<p>
Consideremos el operador <code>/</code>, qué nos devuelve si intentamos dividir
por cero?
</p>

<div class="org-src-container">
<pre class="src src-haskell">ghci&gt; 1 / 0
Infinity
ghci&gt; 0 / 0
NaN
</pre>
</div>

<p>
En ambos casos nos deuvelve un error que es algo complicado de
capturar.
</p>

<p>
Hagamos una función para realizar la división de manera "segura".
</p>

<div class="org-src-container">
<pre class="src src-haskell">safediv :: Double -&gt; Double -&gt; Talvez Double
safediv x y
  | y == 0 = Nada
  | otherwise = Solo (x / y)
</pre>
</div>

<p>
De esta forma podemos capturar estos errores al momento de realizar
más operaciones con éstos elementos.
</p>

<p>
Supongamos que queremos utilizar esta función y al final al
resultado añadirle uno si es que no ocurrió un error:
</p>

<div class="org-src-container">
<pre class="src src-haskell">divadd1 :: Double -&gt; Double -&gt; Talvez Double
divadd1 x y = case safediv x y of
                Nada -&gt; Nada
                Solo r -&gt; Solo (r + 1)
</pre>
</div>

<p>
La definición del tipo de dato <code>Maybe</code> (que ya viene en <i>haskell</i>) es
como sigue:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Maybe a = Nothing
             | Just a 
</pre>
</div>

<p>
También las definiciones de tipo pueden llevar más de un parámetro
en su tipo. Definamos nuestra propia tupla
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Tupla a b = Tup a b
</pre>
</div>

<p>
Recibe dos tipos cualesquiera <code>a</code> y <code>b</code>, y su constructor <code>Tup</code> recibe
esos mismos parámetros respectivamente.
</p>

<div class="org-src-container">
<pre class="src src-haskell">intDouble :: Tupla Int Double
intDouble = Tup 5 10.9

stringDouble :: Tupla String Double
stringDouble = Tup "Hola" 10.18
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb71e3ff" class="outline-2">
<h2 id="orgb71e3ff">Listas</h2>
<div class="outline-text-2" id="text-orgb71e3ff">
<p>
Las listas de elementos de tipo \(A\) se construyen con las siguientes
reglas:
</p>

<ol class="org-ol">
<li>La lista vacía es una lista de elementos de tipo \(A\).</li>

<li>Si \(X\) es un elemento de tipo \(A\) y \(XS\) una lista de elementos
de tipo \(A\), entonces la construcción de \(X\) con \(XS\) (\(X:XS\)) es
otra lista de elementos de tipo \(A\).</li>

<li>Sólo los elementos construidos con las reglas 1 y 2 son listas de
elementos de tipo \(A\).</li>
</ol>


<p>
Entonces podemos describir una lista en <i>haskell</i> de la siguiente
forma:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data Lista a = Nil
             | Cons a (Lista a)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">nums :: Lista Int
nums = Cons 1 (Cons 2 (Cons 3 Nil))

strings :: Lista String
strings = Cons "Hola" (Cons "grupo" Nil)

nil :: Lista Double
nil = Nil

unEntero :: Lista Int
unEntero = Cons 1 Nil

listaDeListas :: Lista (Lista Int)
listaDeListas = Cons (Cons 1 (Cons 2 Nil)) (Cons (Cons 3 (Cons 4 Nil)) Nil)
</pre>
</div>

<p>
<i>Haskell</i> ya tiene su propia definición de listas, y es algo parecido
a la siguiente:
</p>

<div class="org-src-container">
<pre class="src src-haskell">data [] a = []
          | a : ([] a)
</pre>
</div>

<p>
Aquí ellos utilizan un operador <code>:</code> en lugar de un constructor como
nosotros los hemos visto, y ésto es posible porque Haskell admite
operadores binarios en lugar de constructores tradicionales siempre
y cuando éstos comiencen con <code>:</code>
</p>

<p>
De esta forma <i>Haskell</i> perite la construcción de listas de la
siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-haskell">nums :: [] Int
nums = 1 : 2 : 3 []

strings :: [] String
strings = "Hola" : "grupo" : []

nil :: [] Double
nil = []

listaDeListas :: [] ([] Int)
listaDeListas = (1 : 2 : []) : (3 : 4 : []) : []
</pre>
</div>

<p>
Y <i>haskell</i> ofrece una sintaxis aún más sencilla para construir
estas mismas listas, es la siguiente:
</p>

<div class="org-src-container">
<pre class="src src-haskell">nums :: [Int]
nums = [1,2,3]

strings :: [String]
strings = ["Hola","grupo"]

nil :: [Double]
nil = []

listaDeListas :: [[Int]]
listaDeListas = [[1,2],[3,4]]
</pre>
</div>
</div>
