content/presentaciones/Discretas7026/laboratorio.org
** Coincidencia de patrones

   Para las listas, la coincidencia de patrones se puede realizar de
   una forma muy versátil.

   Digamos que queremos hacer una función que nos diga verdadero si
   una lista es vacía o falso en otro caso.

   #+begin_src haskell
vacia :: [Int] -> Bool
vacia [] = True
vacia xs = False
   #+end_src

   Para capturar el caso de la lista vacía, lo logramos con =[]=, y
   cualquier otro caso es capturado por la variable =xs=.

   Notemos que en el segundo caso no utilizamos si quiera la variable
   =xs=, entonces podemos indicarle a /Haskell/ que ignore totalmente su
   valor con el uso del comodín =_=.

   #+begin_src haskell
vacia :: [Int] -> Bool
vacia [] = True
vacia _ = False
   #+end_src

   En la coincidencia de patrones, el comodín =_= podrá capturar
   cualquier caso igual que con las variables, con la diferencia de
   que /haskell/ ignorará completamente su valor y nos dará directamente
   la definición que le hayamos dado.

   ¿Y si quisiéramos una función que nos diga si una lista tiene
   exactamente un elemento?

   #+begin_src haskell
individual :: [Int] -> Bool
individual [x] = True
individual _ = False
   #+end_src

   Con el patrón =[x]= indicamos que queremos capturar exactamente
   cuando la lista tenga un único elemento.

   Y de nuevo, como estamos ignorando el valor de =x= y no lo estamos
   utilizando en la definición, podemos cambiarlo por un comodín.

   #+begin_src haskell
individual :: [Int] -> Bool
individual [_] = True
individual _ = False
   #+end_src

   De la misma forma, podemos capturar cuando haya exactamente cierto
   número de elementos durante la caza de patrones.

   #+begin_src haskell
listaConTres :: [Int] -> Bool
listaConTres [_,_,_] = True
listaConTres _ = False
   #+end_src

   Ahora bien, supongamos que queremos una función que nos regrese el
   primer elemento de una lista si es que tiene elementos.

   #+begin_src haskell
cabeza :: [Int] -> Int
cabeza (x:xs) = x
   #+end_src

   Podemos hacer coincidencia de patrones con la definición inductiva
   separando la cabeza de la lista =x= con la cola =xs=. Y de nuevo, como
   no estamos utilizando =xs= en la definición podemos reemplazarlo con
   un comodín.

   #+begin_src haskell
cabeza :: [Int] -> Int
cabeza (x:_) = x
   #+end_src

   Nótese que esta es una definición incompleta, ya que sólo le
   estamos indicando qué hacer cuando la lista tiene la forma
   =cabeza:cola=, pero no cuando es vacía, por lo que si le pasamos una
   lista vacía, ésta nos lanzará una excepción.

   A veces querrán utilizar éste tipo de funciones para hacer más
   sencillas ciertas operaciones, pero deben tener cuidado con los
   parámetros que le están pasando, y asegurarse que no sea un
   parámetro que ocasione un error.

   Ahora, uno que regrese la cola de una lista.

   #+begin_src haskell
cola :: [Int] -> [Int]
cola (_:xs) = xs
   #+end_src

   ¿Si ahora queremos uno que nos regrese el segundo elemento de una
   lista?

   #+begin_src haskell
segundoElemento :: [Int] -> Int
segundoElemento (x:xs) = ...
   #+end_src

   Sabemos que podemos acceder al primer elemento de la lista, y en
   éste caso es =x=, ¿pero el segundo? no podemos devolver =xs= porque
   ésta es una lista, no un elemento.

   Bueno, aprovechemos que =xs= es una lista para descomponerla también en algo que tiene cabeza y cola.

   #+begin_src haskell
segundoElemento :: [Int] -> Int
segundoElemento (x:(y:ys)) = y
   #+end_src

   Y por tanto el segundo elemento es =y=.

   Cabe decir que los parentesis más internos no son necesarios, pues el operador =:= asocia hacia la derecha, es decir:

   #+begin_src haskell
segundoElemento :: [Int] -> Int
segundoElemento (x:y:ys) = y
   #+end_src

* Ejercicios de recursión

  #+begin_src haskell
-- | Dada una lista de enteros, calcula la suma de todos sus elementos
suma :: [Int] -> Int
suma = undefined

-- | Dada una lista de enteros, calcula la multiplicación de todos sus
-- elementos.
multiplicacion :: [Int] -> Int
multiplicacion = undefined

-- | Dadas dos listas de enteros, une las dos listas en una sola,
-- conservando el mismo orden
une :: [Int] -> [Int] -> [Int]
une = undefined

-- | Dados dos enteros, genera una lista de enteros que empieza desde
-- el primero y termina en el segundo
enumera :: Int -> Int -> [Int]
enumera = undefined
  #+end_src

  
