presentaciones/Discretas7026/laboratorio.html

<div id="outline-container-org33b63a5" class="outline-3">
<h3 id="org33b63a5">Coincidencia de patrones</h3>
<div class="outline-text-3" id="text-org33b63a5">
<p>
Para las listas, la coincidencia de patrones se puede realizar de
una forma muy versátil.
</p>

<p>
Digamos que queremos hacer una función que nos diga verdadero si
una lista es vacía o falso en otro caso.
</p>

<div class="org-src-container">
<pre class="src src-haskell">vacia :: [Int] -&gt; Bool
vacia [] = True
vacia xs = False
</pre>
</div>

<p>
Para capturar el caso de la lista vacía, lo logramos con <code>[]</code>, y
cualquier otro caso es capturado por la variable <code>xs</code>.
</p>

<p>
Notemos que en el segundo caso no utilizamos si quiera la variable
<code>xs</code>, entonces podemos indicarle a <i>Haskell</i> que ignore totalmente su
valor con el uso del comodín <code>_</code>.
</p>

<div class="org-src-container">
<pre class="src src-haskell">vacia :: [Int] -&gt; Bool
vacia [] = True
vacia _ = False
</pre>
</div>

<p>
En la coincidencia de patrones, el comodín <code>_</code> podrá capturar
cualquier caso igual que con las variables, con la diferencia de
que <i>haskell</i> ignorará completamente su valor y nos dará directamente
la definición que le hayamos dado.
</p>

<p>
¿Y si quisiéramos una función que nos diga si una lista tiene
exactamente un elemento?
</p>

<div class="org-src-container">
<pre class="src src-haskell">individual :: [Int] -&gt; Bool
individual [x] = True
individual _ = False
</pre>
</div>

<p>
Con el patrón <code>[x]</code> indicamos que queremos capturar exactamente
cuando la lista tenga un único elemento.
</p>

<p>
Y de nuevo, como estamos ignorando el valor de <code>x</code> y no lo estamos
utilizando en la definición, podemos cambiarlo por un comodín.
</p>

<div class="org-src-container">
<pre class="src src-haskell">individual :: [Int] -&gt; Bool
individual [_] = True
individual _ = False
</pre>
</div>

<p>
De la misma forma, podemos capturar cuando haya exactamente cierto
número de elementos durante la caza de patrones.
</p>

<div class="org-src-container">
<pre class="src src-haskell">listaConTres :: [Int] -&gt; Bool
listaConTres [_,_,_] = True
listaConTres _ = False
</pre>
</div>

<p>
Ahora bien, supongamos que queremos una función que nos regrese el
primer elemento de una lista si es que tiene elementos.
</p>

<div class="org-src-container">
<pre class="src src-haskell">cabeza :: [Int] -&gt; Int
cabeza (x:xs) = x
</pre>
</div>

<p>
Podemos hacer coincidencia de patrones con la definición inductiva
separando la cabeza de la lista <code>x</code> con la cola <code>xs</code>. Y de nuevo, como
no estamos utilizando <code>xs</code> en la definición podemos reemplazarlo con
un comodín.
</p>

<div class="org-src-container">
<pre class="src src-haskell">cabeza :: [Int] -&gt; Int
cabeza (x:_) = x
</pre>
</div>

<p>
Nótese que esta es una definición incompleta, ya que sólo le
estamos indicando qué hacer cuando la lista tiene la forma
<code>cabeza:cola</code>, pero no cuando es vacía, por lo que si le pasamos una
lista vacía, ésta nos lanzará una excepción.
</p>

<p>
A veces querrán utilizar éste tipo de funciones para hacer más
sencillas ciertas operaciones, pero deben tener cuidado con los
parámetros que le están pasando, y asegurarse que no sea un
parámetro que ocasione un error.
</p>

<p>
Ahora, uno que regrese la cola de una lista.
</p>

<div class="org-src-container">
<pre class="src src-haskell">cola :: [Int] -&gt; [Int]
cola (_:xs) = xs
</pre>
</div>

<p>
¿Si ahora queremos uno que nos regrese el segundo elemento de una
lista?
</p>

<div class="org-src-container">
<pre class="src src-haskell">segundoElemento :: [Int] -&gt; Int
segundoElemento (x:xs) = ...
</pre>
</div>

<p>
Sabemos que podemos acceder al primer elemento de la lista, y en
éste caso es <code>x</code>, ¿pero el segundo? no podemos devolver <code>xs</code> porque
ésta es una lista, no un elemento.
</p>

<p>
Bueno, aprovechemos que <code>xs</code> es una lista para descomponerla también en algo que tiene cabeza y cola.
</p>

<div class="org-src-container">
<pre class="src src-haskell">segundoElemento :: [Int] -&gt; Int
segundoElemento (x:(y:ys)) = y
</pre>
</div>

<p>
Y por tanto el segundo elemento es <code>y</code>.
</p>

<p>
Cabe decir que los parentesis más internos no son necesarios, pues el operador <code>:</code> asocia hacia la derecha, es decir:
</p>

<div class="org-src-container">
<pre class="src src-haskell">segundoElemento :: [Int] -&gt; Int
segundoElemento (x:y:ys) = y
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org37f1814" class="outline-2">
<h2 id="org37f1814">Ejercicios de recursión</h2>
<div class="outline-text-2" id="text-org37f1814">
<div class="org-src-container">
<pre class="src src-haskell">-- | Dada una lista de enteros, calcula la suma de todos sus elementos
suma :: [Int] -&gt; Int
suma = undefined

-- | Dada una lista de enteros, calcula la multiplicación de todos sus
-- elementos.
multiplicacion :: [Int] -&gt; Int
multiplicacion = undefined

-- | Dadas dos listas de enteros, une las dos listas en una sola,
-- conservando el mismo orden
une :: [Int] -&gt; [Int] -&gt; [Int]
une = undefined

-- | Dados dos enteros, genera una lista de enteros que empieza desde
-- el primero y termina en el segundo
enumera :: Int -&gt; Int -&gt; [Int]
enumera = undefined
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Erik Rangel Limón</p>
<p class="date">Created: 2024-09-12 Thu 23:42</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
